feniex/firm_F1-TestFixture/F1-TestFixture.cydsn/Generated_Source/PSoC5/DualDelayStatus.h
/*******************************************************************************
* File Name: DualDelayStatus.h  
* Version 1.90
*
* Description:
*  This file containts Status Register function prototypes and register defines
*
* Note:
*
********************************************************************************
* Copyright 2008-2015, Cypress Semiconductor Corporation.  All rights reserved.
* You may use this file only in accordance with the license, terms, conditions, 
* disclaimers, and limitations in the end user license agreement accompanying 
* the software package with which this file was provided.
*******************************************************************************/

#if !defined(CY_STATUS_REG_DualDelayStatus_H) /* CY_STATUS_REG_DualDelayStatus_H */
#define CY_STATUS_REG_DualDelayStatus_H

#include "cyfitter.h"

#if ((CYDEV_CHIP_FAMILY_USED == CYDEV_CHIP_FAMILY_PSOC3) || \
     (CYDEV_CHIP_FAMILY_USED == CYDEV_CHIP_FAMILY_PSOC4) || \
     (CYDEV_CHIP_FAMILY_USED == CYDEV_CHIP_FAMILY_PSOC5))
    #include "cytypes.h"
    #include "CyLib.h"
#else
    #include "syslib/cy_syslib.h"
#endif

    
/***************************************
*     Data Struct Definitions
***************************************/

/* Sleep Mode API Support */
typedef struct
{
    uint8 statusState;

} DualDelayStatus_BACKUP_STRUCT;


/***************************************
*        Function Prototypes
***************************************/

uint8 DualDelayStatus_Read(void) ;
void DualDelayStatus_InterruptEnable(void) ;
void DualDelayStatus_InterruptDisable(void) ;
void DualDelayStatus_WriteMask(uint8 mask) ;
uint8 DualDelayStatus_ReadMask(void) ;


/***************************************
*           API Constants
***************************************/

#define DualDelayStatus_STATUS_INTR_ENBL    0x10u


/***************************************
*         Parameter Constants
***************************************/

/* Status Register Inputs */
#define DualDelayStatus_INPUTS              2


/***************************************
*             Registers
***************************************/

/* Status Register */
#define DualDelayStatus_Status             (* (reg8 *) DualDelayStatus_sts_intr_sts_reg__STATUS_REG )
#define DualDelayStatus_Status_PTR         (  (reg8 *) DualDelayStatus_sts_intr_sts_reg__STATUS_REG )
#define DualDelayStatus_Status_Mask        (* (reg8 *) DualDelayStatus_sts_intr_sts_reg__MASK_REG )
#define DualDelayStatus_Status_Aux_Ctrl    (* (reg8 *) DualDelayStatus_sts_intr_sts_reg__STATUS_AUX_CTL_REG )

#endif /* End CY_STATUS_REG_DualDelayStatus_H */


/* [] END OF FILE */
